[{"link": "../familyChenYang.json", "scenario": "Try to get to know Chen Yang a little better by learning about her family.", "activityName": "Learning about Chen Yang's Parents"}, {"link": "../familyDavid.json", "scenario": "Now that you know a little bit about David, let's learn more about his family and where they're from.", "activityName": "Asking about David's Schedule"}, {"link": "../hobbiesChenYang.json", "scenario": "Try to get to know Chen Yang a little better by learning about her family.", "activityName": "Asking about Chen Yang's Hobbies (Part 1)"}, {"link": "../hobbiesChenYang2.json", "scenario": "Now that you've talked to David about what Chen Yang likes (you do remember, right?), let's see if we can invite her to do one of those activities on the weekend.", "activityName": "Asking about Chen Yang's Hobbies (Part 2)"}, {"link": "../hobbiesDavid.json", "scenario": "Lunch with David was great! Let's figure out whether there are any other activities you both enjoy.", "activityName": "Asking David about his hobbies"}, {"link": "../hobbiesDavidHintsAboutCY.json", "scenario": "I wonder what Chen Yang likes to do on the weekend. Maybe David will know.", "activityName": "Asking about Chen Yang's interest"}, {"link": "../index.json", "scenario": "Try a basic demo with David, who will respond to your greeting and basic questions!", "activityName": "Test"}, {"link": "../introAlex.json", "scenario": "Looks like another student is approaching you as you wait or classes to start. Time for some introductions!", "activityName": "Introduction - Alex"}, {"link": "../introDavid.json", "scenario": "It's the first day of your summer program in Shanghai. There's an awkward looking student standing over there alone. It'd be nice for you to go greet him! ", "activityName": "Introduction - David"}, {"link": "../lewDemo.json", "scenario": "Welcome back from your trip to Toronto! Your friend David has picked you up at the airport and wants to hear all about what you did!", "activityName": "Answering questions about your trip to Toronto"}, {"link": "../lewDemo2.json", "scenario": "Didn't David just come back from Taiwan? Why don't you ask him some questions about his trip on your ride home on the subway?", "activityName": "David's Return from Taiwan"}, {"link": "../likesFoodDavid.json", "scenario": "It'd be great to invite David to lunch sometime. I wonder what kind of food he likes.", "activityName": "Asking what kind of food David likes"}, {"link": "../likesFoodDavid2.json", "scenario": "Now that we know what meals David likes to eat, let's invite him to lunch sometime.", "activityName": "Asking which day David can eat a meal"}, {"link": "../pa1.json", "scenario": "Hey there. I'm M.I.R.I, the Mandarin Intelligence Robot Interpreter. I'm here to help you on your journey to Shanghai!", "activityName": "Pre-assessment - Chinese 1"}, {"link": "../publicDemo.json", "scenario": "Welcome to Shanghai Airport! Looks like your there's a fellow student who's waiting to be picked up. Why don't you head over and chat with him?", "activityName": "Review of Chinese 1"}, {"link": "../publicDemo2.json", "scenario": "Hey! It's a fast food restaurant. Weren't you really craving some burgers and fried rice? I don't know if they even serve fried rice, but it doesn't hurt to ask!", "activityName": "Ordering Food at a Fast Food Restaurant"}, {"link": "../publicDemo3.json", "scenario": "Wow! You're attending National Taiwan University and it's move in day! Looks like your roommate has already arrived. Why don't you try to learn more about her family?", "activityName": "Learning about Alex at National Taiwan University"}, {"link": "../wangDemo.json", "scenario": "You seem really tired recently and want to learn more about David's schedule.", "activityName": "Asking about David's Schedule"}, {"link": "../wangDemo2.json", "scenario": "It's 2:30 and classes are over for the day! Looks like David's looking to chat with you before you head home.", "activityName": "Answering about one's own schedule"}, {"link": "../wangDemo3.json", "scenario": "Now that you've been friends with David for a while, I think it's time to figure out his birthday.", "activityName": "Asking about Birthdays"}, {"link": "../yuDemo.json", "scenario": "There's a fellow student hanging out at the school cafeteria. Let's meet him!", "activityName": "Review of Basic Questions"}]
